:PROPERTIES:
:ID:       63cf63ea-ec98-4b14-b5d3-50d9b0c9f4e6
:LAST_MODIFIED: [2023-09-04 Mon 06:32]
:ROAM_ALIASES: "Asterisk in Python function invocations"
:END:
#+title: Asterisk in Python function arguments
#+hugo_custom_front_matter: :slug "63cf63ea-ec98-4b14-b5d3-50d9b0c9f4e6"
#+author: Cash Prokop-Weaver
#+date: [2023-02-08 Wed 09:43]
#+filetags: :concept:

** In function definition

A single asterisk indicates that all following arguments *must* be [[id:3bd13351-ede1-473b-8789-6a8bfe90a786][Python keyword arguments]]. Additionally, if the asterisk is immediately followed by a parameter (e.g. =*args=) then =args= holds all following positional arguments.

- Standalone asterisk: Forces all arguments after the =*= to be passed as [[id:3bd13351-ede1-473b-8789-6a8bfe90a786][Python keyword arguments]]

  #+begin_src python :results output
def foo(pos, *, forcenamed):
    return (pos, forcenamed)

print(foo(pos=10, forcenamed=20))
print(foo(10, forcenamed=20))
try:
    print(foo(10, 20))
except TypeError as e:
    print(e)
  #+end_src

  #+RESULTS:
  : (10, 20)
  : (10, 20)
  : foo() takes 1 positional argument but 2 were given

- Asterisk with parameter: Forces all arguments after the =*= to be passed as [[id:3bd13351-ede1-473b-8789-6a8bfe90a786][Python keyword arguments]] *and* collects positional arguments.

  #+begin_src python :results output
def foo(pos, *args, forcenamed):
    return (pos, args, forcenamed)

print(foo(pos=10, forcenamed=30))
print(foo(10, 20, 30, 30, forcenamed=50))
try:
    print(foo(10, 20))
except TypeError as e:
    print(e)
  #+end_src

  #+RESULTS:
  : (10, (), 30)
  : (10, (20, 30, 30), 50)
  : foo() missing 1 required keyword-only argument: 'forcenamed'
** In function invocation

A single asterisk in a [[id:27b0e33a-6754-40b8-99d8-46650e8626aa][Python]] function invocation expands a tuple of positional arguments.

#+begin_src python :results output
def foo(a, b, c):
    return a, b, c

args = (10, 20, 30)
print(foo(*args))
#+end_src

#+RESULTS:
: (10, 20, 30)

* Double asterisk

A double asterisk (i.e. =**=) precedes a dictionary of [[id:3bd13351-ede1-473b-8789-6a8bfe90a786][Python keyword arguments]].

#+begin_src python :results output
def foo(a, b, **c):
    return a, b, c

print(foo(10, 20))
print(foo(10, 20, c=30, d=40))
try:
    print(foo(10, 20, 30))
except TypeError as e:
    print(e)
#+end_src

#+RESULTS:
: (10, 20, {})
: (10, 20, {'c': 30, 'd': 40})
: foo() takes 2 positional arguments but 3 were given

** In function invocation

A double asterisk in a [[id:27b0e33a-6754-40b8-99d8-46650e8626aa][Python]] function invocation expands a dictionary of keyword arguments.

#+begin_src python :results output
def foo(a, b, c):
    return a, b, c

kwargs = {'b': 20, 'c': 30}
print(foo(10, **kwargs))
#+end_src

#+RESULTS:
: (10, 20, 30)

